# Ввести с клавиатуры строку.
# Вывести эту же строку вертикально: 
# по одному символу на строку консоли.

string1=input("Введите строку: ")
for letter in string1:
    print(letter)