# Создать список из десяти целых чисел.
# Вывести на экран каждое число, увеличенное на 1.

list1=[1,2,3,4,5,6,7,8,9,10]
for item in list1:
    print(item+1)